bench/results/raw/ab-20260923-192739/new-r1-h2-_-c64-m1.txt
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #1: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #2: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #3: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
Warm-up started for thread #1.
Warm-up started for thread #2.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up started for thread #3.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up started for thread #0.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 5.00s, 312537.20 req/s, 333.23MB/s
requests: 1562686 total, 1562750 started, 1562686 done, 1562686 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1562686 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1.63GB (1747087236) total, 159.46MB (167207402) headers (space savings 42.78%), 1.45GB (1551747198) data
                     min         max         mean         sd        +/- sd
time for request:        5us      4.29ms       203us        67us    79.93%
time for connect:     1.47ms     13.04ms      5.45ms      3.53ms    67.19%
time to 1st byte:     2.31ms     13.22ms      6.07ms      3.25ms    73.44%
req/s           :    4863.58     4907.02     4883.10       10.05    68.75%